--- crates/transport/runtime/src/endpoint_queue.rs
+++ replace EndpointQueues::open with ()
@@ -157,23 +157,17 @@
     /// anyway rather than trusted, because this type must not depend on
     /// a caller having validated it.
     ///
     /// Re-opening an endpoint that already has a queue REPLACES it and
     /// discards what it held. That is the lease changing hands, and the
     /// new holder must not inherit the previous session's undelivered
     /// messages.
     pub fn open(&mut self, endpoint: EndpointId, bound: usize) {
-        self.queues.insert(
-            endpoint,
-            Queue {
-                events: VecDeque::new(),
-                bound: bound.max(1),
-            },
-        );
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Close `endpoint`'s queue, discarding anything still in it.
     ///
     /// Returns how many events were dropped, so a caller can log a real
     /// number rather than assert a silent one.
     pub fn close(&mut self, endpoint: &EndpointId) -> usize {
         self.queues
