--- crates/transport/runtime/src/endpoint_queue.rs
+++ replace EndpointQueues::is_open -> bool with false
@@ -179,17 +179,17 @@
         self.queues
             .remove(endpoint)
             .map_or(0, |queue| queue.events.len())
     }
 
     /// Whether a queue is open for `endpoint`.
     #[must_use]
     pub fn is_open(&self, endpoint: &EndpointId) -> bool {
-        self.queues.contains_key(endpoint)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// How many events are waiting for `endpoint`.
     #[must_use]
     pub fn len(&self, endpoint: &EndpointId) -> usize {
         self.queues.get(endpoint).map_or(0, |q| q.events.len())
     }
 
