--- crates/transport/runtime/src/endpoint_queue.rs
+++ replace EndpointQueues::is_empty -> bool with true
@@ -191,17 +191,17 @@
     #[must_use]
     pub fn len(&self, endpoint: &EndpointId) -> usize {
         self.queues.get(endpoint).map_or(0, |q| q.events.len())
     }
 
     /// Whether any queue is open.
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.queues.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Admit one event, or say why not.
     ///
     /// THE ACCEPTANCE POINT. A caller answers `AcceptedV2` if and only if
     /// this returned `Ok`.
     ///
     /// # Errors
