--- crates/transport/runtime/src/endpoint_queue.rs
+++ replace EndpointQueues::push -> Result<(), QueueRefusal> with Ok(())
@@ -208,24 +208,17 @@
     /// [`QueueRefusal::NotOpen`] when nothing holds the endpoint's lease,
     /// [`QueueRefusal::Full`] when it is at its bound. Both have coarse
     /// wire codes via [`QueueRefusal::to_wire`], and they are not the
     /// same code.
     pub fn push(&mut self, event: DirectEvent) -> Result<(), QueueRefusal> {
         // NOT `entry().or_insert_with(..)`. The endpoint here came from a
         // remote frame, and creating a queue for it would let a peer grow
         // this map by naming endpoints that do not exist.
-        let Some(queue) = self.queues.get_mut(&event.destination_endpoint) else {
-            return Err(QueueRefusal::NotOpen);
-        };
-        if queue.events.len() >= queue.bound {
-            return Err(QueueRefusal::Full { bound: queue.bound });
-        }
-        queue.events.push_back(event);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Take everything waiting for `endpoint`, oldest first.
     ///
     /// Empty for an endpoint with no open queue, which is the same answer
     /// as an open-but-idle one. A drainer learns nothing about presence
     /// it did not already have — it holds the lease.
     pub fn drain(&mut self, endpoint: &EndpointId) -> Vec<DirectEvent> {
