--- crates/transport/runtime/src/endpoint_queue.rs
+++ replace >= with < in EndpointQueues::push
@@ -211,17 +211,17 @@
     /// same code.
     pub fn push(&mut self, event: DirectEvent) -> Result<(), QueueRefusal> {
         // NOT `entry().or_insert_with(..)`. The endpoint here came from a
         // remote frame, and creating a queue for it would let a peer grow
         // this map by naming endpoints that do not exist.
         let Some(queue) = self.queues.get_mut(&event.destination_endpoint) else {
             return Err(QueueRefusal::NotOpen);
         };
-        if queue.events.len() >= queue.bound {
+        if queue.events.len() < /* ~ changed by cargo-mutants ~ */ queue.bound {
             return Err(QueueRefusal::Full { bound: queue.bound });
         }
         queue.events.push_back(event);
         Ok(())
     }
 
     /// Take everything waiting for `endpoint`, oldest first.
     ///
